Revit 2026 API

# Stone Properties

---

The Stone type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CommonTintColor | The property labeled "Tint Color" from the "Stone" schema. |
|  | CommonTintToggle | The property labeled "Tint" from the "Stone" schema. |
|  | StoneApplication | The property labeled "Finish" from the "Stone" schema. |
|  | StoneBump | The property labeled "Type" from the "Stone" schema. |
|  | StoneBumpAmount | The property labeled "Amount" from the "Stone" schema. |
|  | StoneBumpMap | The property labeled "Image" from the "Stone" schema. |
|  | StoneColor | The property labeled "Image" from the "Stone" schema. |
|  | StonePattern | The property labeled "Relief Pattern" from the "Stone" schema. |
|  | StonePatternAmount | The property labeled "Amount" from the "Stone" schema. |
|  | StonePatternMap | The property labeled "Image" from the "Stone" schema. |

#### Reference

Stone Class

Autodesk.Revit.DB.Visual Namespace